
## Plan Result

[CI link](https://github.com/shotaIDE/my-pet-melody/actions/runs/10226340862)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 3 to change, 1 to destroy.</code></pre>

* Update
  * google_cloudfunctions_function.detect
  * google_cloudfunctions_function.piece
  * google_cloudfunctions_function.submit
* Replace
  * google_storage_bucket_object.functions_src


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_cloudfunctions_function.detect will be updated in-place
  ~ resource "google_cloudfunctions_function" "detect" {
        id                            = "colomney-my-pet-melody-dev/asia-east1/detect"
        name                          = "detect"
      ~ source_archive_object         = "functions/src_e62e3e511efd7125f33ef772c7840d8c.zip" -> "functions/src_b18152727a91e5ffc2cd71a2c15f7722.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function.piece will be updated in-place
  ~ resource "google_cloudfunctions_function" "piece" {
        id                            = "colomney-my-pet-melody-dev/asia-east1/piece"
        name                          = "piece"
      ~ source_archive_object         = "functions/src_e62e3e511efd7125f33ef772c7840d8c.zip" -> "functions/src_b18152727a91e5ffc2cd71a2c15f7722.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function.submit will be updated in-place
  ~ resource "google_cloudfunctions_function" "submit" {
        id                            = "colomney-my-pet-melody-dev/asia-east1/submit"
        name                          = "submit"
      ~ source_archive_object         = "functions/src_e62e3e511efd7125f33ef772c7840d8c.zip" -> "functions/src_b18152727a91e5ffc2cd71a2c15f7722.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_storage_bucket_object.functions_src must be replaced
-/+ resource "google_storage_bucket_object" "functions_src" {
      + content             = (sensitive value)
      ~ content_type        = "application/zip" -> (known after apply)
      ~ crc32c              = "oL71lQ==" -> (known after apply)
      ~ detect_md5hash      = "5i4+UR79cSXzPvdyx4QNjA==" -> "different hash" # forces replacement
      - event_based_hold    = false -> null
      ~ id                  = "colomney-my-pet-melody-dev-deploy-functions/src_e62e3e511efd7125f33ef772c7840d8c.zip" -> (known after apply)
      + kms_key_name        = (known after apply)
      ~ md5hash             = "5i4+UR79cSXzPvdyx4QNjA==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/colomney-my-pet-melody-dev-deploy/o/functions%2Fsrc_e62e3e511efd7125f33ef772c7840d8c.zip?generation=1722554238047172&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "functions/src_e62e3e511efd7125f33ef772c7840d8c.zip" -> "functions/src_b18152727a91e5ffc2cd71a2c15f7722.zip" # forces replacement
      ~ output_name         = "functions/src_e62e3e511efd7125f33ef772c7840d8c.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/colomney-my-pet-melody-dev-deploy/o/functions%2Fsrc_e62e3e511efd7125f33ef772c7840d8c.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"check-plan","PRNumber":1201,"Program":"tfcmt","SHA1":"856a9e5be9784e8c85d77aacc816206a0a523b44","Vars":{},"WorkflowName":"CI / Infrastructure Develop"} -->